tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1455_tdd.h
#define PPB                           522
#define PPB0                          523
#define PPB1                          524
#define FSEN                          525
#define UPUEN                         526
#define UTEYE                         527
#define UIE                           528
#define URSTIE                        529
#define UERRIE                        530
#define ACTVIE                        531
#define TRNIE                         532
#define IDLEIE                        533
#define STALLIE                       534
#define SOFIE                         535
#define UEIR                          536
#define PIDEF                         537
#define CRC5EF                        538
#define CRC16EF                       539
#define DFN8EF                        540
#define BTOEF                         541
#define BTSEF                         542
#define UFRMH                         543
#define FRM8                          544
#define FRM9                          545
#define FRM10                         546
#define UFRML                         547
#define FRM0                          548
#define FRM1                          549
#define FRM2                          550
#define FRM3                          551
#define FRM4                          552
#define FRM5                          553
#define FRM6                          554
#define FRM7                          555
#define UADDR                         556
#define ADDR0                         557
#define ADDR1                         558
#define ADDR2                         559
#define ADDR3                         560
#define ADDR4                         561
#define ADDR5                         562
#define ADDR6                         563
#define UEIE                          564
#define PIDEE                         565
#define CRC5EE                        566
#define CRC16EE                       567
#define DFN8EE                        568
#define BTOEE                         569
#define BTSEE                         570
#define UEP0                          571
#define UEP0_EPSTALL                  572
#define UEP0_EPINEN                   573
#define UEP0_EPOUTEN                  574
#define UEP0_EPCONDIS                 575
#define UEP0_EPHSHK                   576
#define UEP1                          577
#define UEP1_EPSTALL                  578
#define UEP1_EPINEN                   579
#define UEP1_EPOUTEN                  580
#define UEP1_EPCONDIS                 581
#define UEP1_EPHSHK                   582
#define UEP2                          583
#define UEP2_EPSTALL                  584
#define UEP2_EPINEN                   585
#define UEP2_EPOUTEN                  586
#define UEP2_EPCONDIS                 587
#define UEP2_EPHSHK                   588
#define UEP3                          589
#define UEP3_EPSTALL                  590
#define UEP3_EPINEN                   591
#define UEP3_EPOUTEN                  592
#define UEP3_EPCONDIS                 593
#define UEP3_EPHSHK                   594
#define UEP4                          595
#define UEP4_EPSTALL                  596
#define UEP4_EPINEN                   597
#define UEP4_EPOUTEN                  598
#define UEP4_EPCONDIS                 599
#define UEP4_EPHSHK                   600
#define UEP5                          601
#define UEP5_EPSTALL                  602
#define UEP5_EPINEN                   603
#define UEP5_EPOUTEN                  604
#define UEP5_EPCONDIS                 605
#define UEP5_EPHSHK                   606
#define UEP6                          607
#define UEP6_EPSTALL                  608
#define UEP6_EPINEN                   609
#define UEP6_EPOUTEN                  610
#define UEP6_EPCONDIS                 611
#define UEP6_EPHSHK                   612
#define UEP7                          613
#define UEP7_EPSTALL                  614
#define UEP7_EPINEN                   615
#define UEP7_EPOUTEN                  616
#define UEP7_EPCONDIS                 617
#define UEP7_EPHSHK                   618
#define STATUS_SHAD                   619
#define STATUS_SHAD_C                 620
#define STATUS_SHAD_DC                621
#define STATUS_SHAD_Z                 622
#define WREG_SHAD                     623
#define BSR_SHAD                      624
#define PCLATH_SHAD                   625
#define FSR0L_SHAD                    626
#define FSR0H_SHAD                    627
#define FSR1L_SHAD                    628
#define FSR1H_SHAD                    629
#define STKPTR                        630
#define TOSL                          631
#define TOSH                          632

#endif // _PIC16F1455_H_
